#### Terraform Plan Output
   ```
   data.terraform_remote_state.fabric: Reading...
data.terraform_remote_state.fabric: Read complete after 0s
module.vpn_routing.apstra_datacenter_routing_policy.vpn["Vendor_A"]: Refreshing state... [id=uNr43rk8TX7_xsjcIyM]
module.vpn_routing.apstra_datacenter_routing_policy.vpn["Vendor_C"]: Refreshing state... [id=9oqFIJ2YI_smqRntvyY]
module.vpn_routing.apstra_datacenter_routing_policy.vpn["Vendor_B"]: Refreshing state... [id=OnDCBQOplAXN37jTqCc]
module.vpn_routing.apstra_datacenter_connectivity_template.vpn: Refreshing state... [id=01971f28-29c9-11ef-841f-617073747261]
null_resource.force_redeploy: Refreshing state... [id=7055341221196613746]
apstra_blueprint_deployment.dc_1: Refreshing state...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # null_resource.force_redeploy must be replaced
-/+ resource "null_resource" "force_redeploy" {
      ~ id       = "7055341221196613746" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "fabric_staging_revision" = "20" -> (known after apply)
        }
    }

  # module.vpn_routing.data.apstra_blueprint_deployment.dc_1 will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "apstra_blueprint_deployment" "dc_1" {
      + blueprint_id            = "b5e20e09-a388-4c55-92f1-601ddb947ef9"
      + comment                 = (known after apply)
      + has_uncommitted_changes = (known after apply)
      + revision_active         = (known after apply)
      + revision_staged         = (known after apply)
    }

  # module.vpn_routing.data.apstra_datacenter_ct_bgp_peering_ip_endpoint.vpn will be read during apply
  # (config refers to values not yet known)
 <= data "apstra_datacenter_ct_bgp_peering_ip_endpoint" "vpn" {
      + child_primitives = [
          + (known after apply),
          + (known after apply),
          + (known after apply),
        ]
      + ipv4_address     = "192.168.5.5"
      + name             = "BGP peering with VPN router"
      + primitive        = (known after apply)
    }

  # module.vpn_routing.data.apstra_datacenter_ct_ip_link.vpn will be read during apply
  # (config refers to values not yet known)
 <= data "apstra_datacenter_ct_ip_link" "vpn" {
      + child_primitives     = [
          + (known after apply),
        ]
      + ipv4_addressing_type = "numbered"
      + name                 = "IP handoff to VPN router"
      + primitive            = (known after apply)
      + routing_zone_id      = "tll1finTskAmk2r_Y0k"
    }

  # module.vpn_routing.data.apstra_datacenter_ct_routing_policy.vpn["Vendor_A"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "apstra_datacenter_ct_routing_policy" "vpn" {
      + name              = "Vendor A Routing Policy"
      + primitive         = (known after apply)
      + routing_policy_id = "uNr43rk8TX7_xsjcIyM"
    }

  # module.vpn_routing.data.apstra_datacenter_ct_routing_policy.vpn["Vendor_B"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "apstra_datacenter_ct_routing_policy" "vpn" {
      + name              = "Vendor B Routing Policy"
      + primitive         = (known after apply)
      + routing_policy_id = "OnDCBQOplAXN37jTqCc"
    }

  # module.vpn_routing.data.apstra_datacenter_ct_routing_policy.vpn["Vendor_C"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "apstra_datacenter_ct_routing_policy" "vpn" {
      + name              = "Vendor C Routing Policy"
      + primitive         = (known after apply)
      + routing_policy_id = "9oqFIJ2YI_smqRntvyY"
    }

  # module.vpn_routing.apstra_datacenter_connectivity_template.vpn will be updated in-place
  ~ resource "apstra_datacenter_connectivity_template" "vpn" {
        id           = "01971f28-29c9-11ef-841f-617073747261"
        name         = "IP+BGP handoff to VPN block"
      ~ primitives   = [
          - jsonencode(
                {
                  - data  = {
                      - child_primitives     = [
                          - jsonencode(
                                {
                                  - data  = {
                                      - bfd_enabled          = false
                                      - child_primitives     = [
                                          - jsonencode(
                                                {
                                                  - data  = {
                                                      - routing_policy_id = "9oqFIJ2YI_smqRntvyY"
                                                    }
                                                  - label = "Vendor C Routing Policy"
                                                  - type  = "AttachExistingRoutingPolicy"
                                                }
                                            ),
                                          - jsonencode(
                                                {
                                                  - data  = {
                                                      - routing_policy_id = "OnDCBQOplAXN37jTqCc"
                                                    }
                                                  - label = "Vendor B Routing Policy"
                                                  - type  = "AttachExistingRoutingPolicy"
                                                }
                                            ),
                                          - jsonencode(
                                                {
                                                  - data  = {
                                                      - routing_policy_id = "uNr43rk8TX7_xsjcIyM"
                                                    }
                                                  - label = "Vendor A Routing Policy"
                                                  - type  = "AttachExistingRoutingPolicy"
                                                }
                                            ),
                                        ]
                                      - hold_time            = null
                                      - ipv4_address         = "192.168.5.5"
                                      - ipv4_afi_enabled     = true
                                      - ipv6_address         = null
                                      - ipv6_afi_enabled     = false
                                      - keepalive_time       = null
                                      - local_asn            = null
                                      - neighbor_asn         = null
                                      - neighbor_asn_dynaimc = true
                                      - password             = null
                                      - ttl                  = 0
                                    }
                                  - label = "BGP peering with VPN router"
                                  - type  = "AttachIpEndpointWithBgpNsxt"
                                }
                            ),
                        ]
                      - ipv4_addressing_type = "numbered"
                      - ipv6_addressing_type = "none"
                      - routing_zone_id      = "tll1finTskAmk2r_Y0k"
                      - tagged               = false
                    }
                  - label = "IP handoff to VPN router"
                  - type  = "AttachLogicalLink"
                }
            ),
          + (known after apply),
        ]
        tags         = [
            "terraform",
            "test",
        ]
        # (2 unchanged attributes hidden)
    }

  # module.vpn_routing.apstra_datacenter_routing_policy.vpn["Vendor_C"] will be updated in-place
  ~ resource "apstra_datacenter_routing_policy" "vpn" {
      ~ description         = "Vendor_C: Import count: 3 Export count: 2" -> "Vendor_C: Import count: 6 Export count: 2"
      ~ extra_exports       = [
          ~ {
              ~ prefix = "10.5.20.0/22" -> "10.5.32.0/22"
                # (1 unchanged attribute hidden)
            },
            # (1 unchanged element hidden)
        ]
      ~ extra_imports       = [
          ~ {
              ~ prefix = "172.18.0.0/24" -> "172.18.10.0/24"
                # (1 unchanged attribute hidden)
            },
          ~ {
              ~ prefix = "172.18.3.0/24" -> "172.18.12.0/24"
                # (1 unchanged attribute hidden)
            },
          ~ {
              ~ prefix = "172.18.5.0/24" -> "172.18.14.0/24"
                # (1 unchanged attribute hidden)
            },
          + {
              + action = "permit"
              + prefix = "172.18.20.0/24"
            },
          + {
              + action = "permit"
              + prefix = "172.18.22.0/24"
            },
          + {
              + action = "permit"
              + prefix = "172.18.24.0/24"
            },
        ]
        id                  = "9oqFIJ2YI_smqRntvyY"
        name                = "Vendor_C"
        # (5 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

   ```
   